	"""
	EXAMPLES ::
	sage: R=PolynomialRing(QQ,'x')
	sage: x=R.gen()
	sage: R=x
	sage: log1(R,10)
	1/9*x^9 - 1/8*x^8 + 1/7*x^7 - 1/6*x^6 + 1/5*x^5 - 1/4*x^4 + 1/3*x^3 - 1/2*x^2 + x

	sage: R=x
	sage: exp(R,10)
	1/362880*x^9 + 1/40320*x^8 + 1/5040*x^7 + 1/720*x^6 + 1/120*x^5 + 1/24*x^4 + 1/6*x^3 + 1/2*x^2 + x + 1
	
	sage: R=PolynomialRing(CC,'x')
	sage: x=R.gen()
	sage: R=x
	sage: fsin(R,10)
	(2.75573192239876e-6)*x^9 - 0.000198412698412700*x^7 + 0.00833333333333334*x^5 - 0.166666666666667*x^3 + x

	sage: fcos(R,10)
	0.0000248015873015880*x^8 - 0.00138888888888889*x^6 + 0.0416666666666667*x^4 - 0.500000000000000*x^2 + 1.00000000000000

	sage: ftan(R,10)
	(9.46599383066042e-8)*x^17 + (-6.58204382576080e-6)*x^15 + 0.000270015799529688*x^13 - 0.00505897266313933*x^11 + 0.0218694885361552*x^9 + 0.0539682539682540*x^7 + 0.133333333333333*x^5 + 0.333333333333333*x^3 + x

	sage: farctan(R,10)
	0.111111111111111*x^9 - 0.142857142857143*x^7 + 0.200000000000000*x^5 - 0.333333333333333*x^3 + x
	
	"""
